Revit 2026 API

# FabricationPartAddPartCustomData Method

---

Add custom data type to the fabrication part. The new data gets the default value defined by the fabrication configuration.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool AddPartCustomData(
	int customId
)
```
```vb
Public Function AddPartCustomData (
	customId As Integer
) As Boolean
```
```cpp
public:
bool AddPartCustomData(
	int customId
)
```
```fsharp
member AddPartCustomData :
        customId : int -> bool
```

#### Parameters

customId Int32
     The identifier of the custom data field to add.

#### Return Value

Boolean Returns true if the type was not already present.

| Exception | Condition |
| --- | --- |
| ArgumentException | The custom data identifier does not exist. |

The custom id must be positive.

#### Reference

FabricationPart Class

Autodesk.Revit.DB Namespace